app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" ORDER BY RANDOM() LIMIT 1
---
	<div id="center">
		<h1><%= Post.first(:order => "RANDOM()").title %>n</h1>