app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY RANDOM() LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "me"], ["created_at", Wed, 25 Jul 2012 19:29:04 UTC +00:00], ["title", "tester"], ["updated_at", Wed, 25 Jul 2012 19:29:04 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'this is exactly 140 characterssssss!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!', "updated_at" = '2012-08-17 19:46:55.231380' WHERE "posts"."id" = 11